app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "release_year", "duration", "synopsis", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"